app/views/sellers/select.html.erb

SELECT "sellers".* FROM "sellers"
---
    <%= form_tag do %>
      <%= collection_select(:seller, :id, Seller.all, :id, :name) %>