app/views/items/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %><br>
    <%= f.collection_select :category_ids, Category.all, :id, :name, {}, { multiple: true } %>