app/controllers/application_controller.rb

  def current_seller
    @current_seller ||= Seller.find(session[:seller_id]) if session[:seller_id]
---
SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]