app/controllers/categories_controller.rb

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def index
    if params[:seller_id].present? || session[:seller_id].present?
      session[:seller_id] = params[:seller_id] if params[:seller_id].present?
      @seller = Seller.find_by(id: session[:seller_id])



      if @seller.nil?
        redirect_to root_path, alert: 'Seller not found'
        return
      end
    else
      redirect_to root_path, alert: 'Seller ID not provided'
      return
    end

    @categories = Category.all

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Cars"], ["created_at", "2023-11-24 22:48:13.402058"], ["updated_at", "2023-11-24 22:48:13.402058"]]
---
  def create
    @seller = Seller.find_by(id: session[:seller_id])
    @category = Category.new(category_params)
    if @category.save

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @seller = Seller.find_by(id: session[:seller_id])