app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "description", "seller_id", "listing_date", "listed_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"