app/controllers/sellers_controller.rb

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @seller = Seller.find(params[:id] || params[:seller][:id])

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @seller = Seller.find(params[:id].keys[0])

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @seller = Seller.find(params[:seller][:id])

INSERT INTO "sellers" ("name", "description", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "roy store"], ["description", "hi "], ["address", "123 st iowa city"], ["created_at", "2023-11-17 00:40:41.030849"], ["updated_at", "2023-11-17 00:40:41.030849"]]
INSERT INTO "sellers" ("name", "description", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "roy store"], ["description", "hi "], ["address", "123 st iowa city"], ["created_at", "2023-11-23 23:17:55.184762"], ["updated_at", "2023-11-23 23:17:55.184762"]]
---
  def create
    @seller = Seller.new(seller_params)
    @seller.user << current_user
    if @seller.save

SELECT "sellers".* FROM "sellers"
---
  def select
    @valid_sellers = Seller.all